app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
	def edit
		@school_class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-09-05 21:31:58.427658"], ["id", 1]]
---
	def update
		@school_class = SchoolClass.find_by(params[:id])
		@school_class.update(params[:school_class])